InletMesh_FineMEsh_pitzDaily1/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 440.15;

boundaryField
{
   inletFace
    {
        type            empty;
    }

    inlet
    {
    {
        type            fixedValue;
        value           $internalField;
    }

    inletWalls
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    outletInlet
    {
        type            zeroGradient;
    }
    outletInlet
    {
        type            cyclicAMI;
    }
    fineSymmetryWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    fineWalls
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    fineCyclicBoundary
    {
        type            zeroGradient;
    }
    fineplug
    {
        type            cyclicAMI;
    }
    faceFine
    {
        type            empty;
    }

}


// ************************************************************************* //
